Renova/src/DataProcessors/ЗагрузкаКод7ки/ЗагрузкаКод7ки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКод7ки</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаМоделей</name>
    <attributes>
      <name>МодельИзФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеСправочника</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Код7ки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Renova/src/DataProcessors/ЗагрузкаКод7ки/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;         
		ПрочитатьТабличныйДокументИзExcel(Объект.ПутьКФайлу);
		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции   

// Процедура - Прочитать табличный документ из excel
// считывает данные из файла *.xls, загружает их в таблицу значений и вызывает процедуру загрузки таблицы моделей в ТЧ  

// Параметры:
//  ПутьКФайлу		 - Строка	 - Путь к файлу загрузки
//  НомерЛистаExcel	 - Число	 - Если не указано, то 1
//
&НаСервере
Процедура ПрочитатьТабличныйДокументИзExcel(ПутьКФайлу, НомерЛистаExcel = 1) Экспорт
	
	
	ТабДок = Новый ТабличныйДокумент; 
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат;
	КонецПопытки;
	
	Построитель = Новый ПостроительЗапроса; 
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());
	Построитель.ЗаполнитьНастройки();
	Построитель.Выполнить();
	
	ТаблицаИзExcel = Построитель.Результат.Выгрузить();
	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТаблицаИзExcel); 
	ЗагрузитьТаблицуМоделей(ТаблицаИзExcel);
	
КонецПроцедуры // ()  

// Процедура - Загрузить таблицу моделей
// загружает выбранные из файла данные в табличную часть и ищет соответствующие им элементы в справочнике "модели продукции"  

// Параметры:
//  ТаблицаЗначений	 - таблица значений	 - данные полученные при чтении файла *.Xls
//
&НаСервере
Процедура ЗагрузитьТаблицуМоделей(ТаблицаЗначений)
	//создаем соответствие необходимых данных из таблицы значений   ключ - наименование модели; значение - код7ки
	ДанныеМоделей = Новый Соответствие; 
	ДанныеПоКоду = Новый Соответствие;
	// ищем наименование модели (наличие цифр в части наименования, содержащей код модели)
	Для каждого СтрокаДанных  Из ТаблицаЗначений Цикл
		МассивПодстрок = СтрРазделить(СокрЛП(СтрокаДанных.Наименование)," ",Ложь); 
		//выбираем только элементы (по наличию цифр в наименовании)
		Для каждого Элемент Из МассивПодстрок Цикл 
			Для Индекс = 0 По СтрДлина(Элемент) Цикл
				ЕстьЧисло = Ложь;
				Символ = НРег(Сред(Элемент, Индекс, 1)); 
				Если Найти("1234567890", Символ) Тогда					
					ЕстьЧисло = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьЧисло Тогда 
				//значит это элемент, добавляем данные в соответствие 
				Наименование = СтрЗаменить(СтрокаДанных.Наименование, " ",""); 
				Наименование = СтрЗаменить(СтрокаДанных.Наименование, "-","");
				ДанныеМоделей.Вставить(Наименование,СтрокаДанных.Код); 
				ДанныеПоКоду.Вставить(СтрокаДанных.Код,СтрокаДанных.Наименование);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	  //находим элементы записанные в справочник
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МоделиПродукции.Ссылка КАК Ссылка,
	               |	МоделиПродукции.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.МоделиПродукции КАК МоделиПродукции
	               |ГДЕ
	               |	МоделиПродукции.ЭтоГруппа = ЛОЖЬ";
	Результат = Запрос.Выполнить();
		  //ищем вхождение строки наименования элементов справочника  в название модели из файла 
	  
	  Выборка = Результат.Выбрать(); 
	  Пока Выборка.Следующий () Цикл
		  НоваяСтрока = Объект.ТаблицаМоделей.Добавить();
		  НоваяСтрока.ДанныеСправочника = Выборка.Ссылка;
		  Наименование = СтрЗаменить(Выборка.Наименование," ",""); 
		  Наименование = СтрЗаменить(Выборка.Наименование,"-","");

		  Для каждого Элемент Из ДанныеМоделей Цикл
			  Если СтрНайти(Элемент.Ключ,Наименование)>0  Тогда 
					  НоваяСтрока.Код7ки = Элемент.Значение; 
				  Для каждого Код Из ДанныеПоКоду Цикл
					  Если Код.Ключ = НоваяСтрока.Код7ки Тогда
						  НоваяСтрока.МодельИзФайла = код.Значение; 
					  КонецЕсли;
				  КонецЦикла;    
			  КонецЕсли;
		  КонецЦикла;
	  КонецЦикла;
КонецПроцедуры

 
// Процедура - Сохранить на сервере
//  Проверяет заполненность код7ки в ТЧ формы и заполняет ее у соответствующих элементов справочника 
// 
&НаСервере
Процедура СохранитьНаСервере()
	 ДобавленоКодов = 0;
	 Для каждого СтрокаДанных Из Объект.ТаблицаМоделей Цикл
		 СсылкаНаЭлемент =  СтрокаДанных.ДанныеСправочника;
		Если ЗначениеЗаполнено(СтрокаДанных.Код7ки) Тогда
		     ЭлементОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
			 ЭлементОбъект.Код7ки = СтрокаДанных.Код7ки;
			 ЭлементОбъект.Записать();		
		  ДобавленоКодов = ДобавленоКодов +1;
		КонецЕсли;
	КонецЦикла;	
	Сообщение = Новый СообщениеПользователю; 
	Текст = СтрШаблон("Изменено %1 элементов",ДобавленоКодов );
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

&НаСервере
Процедура ОчиститьКод7киНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	МоделиПродукции.Ссылка КАК Ссылка,
	              |	МоделиПродукции.Код7ки КАК Код7ки
	              |ИЗ
	              |	Справочник.МоделиПродукции КАК МоделиПродукции
	              |ГДЕ
	              |	МоделиПродукции.ЭтоГруппа = Ложь";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если ЗначениеЗаполнено(Выборка.Код7ки) Тогда
		     ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();  
			 ЭлементОбъект.Код7ки = Неопределено;
			  ЭлементОбъект.Записать();
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКод7ки(Команда)
	ОчиститьКод7киНаСервере();
КонецПроцедуры


#КонецОбласти
